In [30]:
import pandas as pd

In [31]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 
               'Sam': [94, 77, 90], 'Katie': [100, 81, 82],
               'Bob': [ 83, 65, 85]}

In [32]:
grades = pd.DataFrame (grades_dict)

In [33]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [34]:
grades.index = ['Test1', 'Test2', 'Test3']

In [35]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [36]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [37]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

In [38]:
grades.iloc[0]

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [39]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [40]:
## I prefer .iloc since the quotes are not required and it is easier to type CNM

In [41]:
grades.at['Test2', 'Eva']

87

In [43]:
grades.iat[2,0]

70

In [44]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [45]:
grades.mean()

Wally    84.333333
Eva      92.333333
Sam      87.000000
Katie    87.666667
Bob      77.666667
dtype: float64

In [47]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70